# Classification Analysis of the Titanic Dataset (Midterm Project)
**Author:** Jarred Gastreich 
**Date:** November, 2, 2025 
**Objective:** This project tests multiple models that classify data for decision-making. The Titanic Dataset predicts survival on Titantic via multiple features.

## Import External Python Libraries

In [1]:
# Imports

import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

from sklearn.model_selection import StratifiedShuffleSplit
from sklearn.tree import DecisionTreeClassifier, plot_tree
from sklearn.svm import SVC
from sklearn.neural_network import MLPClassifier
from sklearn.metrics import classification_report, confusion_matrix
from sklearn.model_selection import StratifiedShuffleSplit
from sklearn.metrics import classification_report, confusion_matrix
from sklearn.metrics import confusion_matrix
import seaborn as sns
from sklearn.tree import plot_tree
import matplotlib.pyplot as plt
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
import matplotlib.pyplot as plt # all imports at the top

import seaborn as sns
from sklearn.metrics import confusion_matrix
from sklearn.neural_network import MLPClassifier

import numpy as np
import matplotlib.pyplot as plt
from matplotlib.colors import ListedColormap

# Section 1. Import and Inspect Data

## 1.1 Load the dataset and display the first 10 rows.

In [2]:
# Load dataset
titanic = sns.load_dataset('titanic')

# Display a few records to verify
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

## 1.2 Check for missing values and display summary statistics

In [3]:
print("--- Missing Values Summary ---")
print(titanic.isnull().sum())

--- Missing Values Summary ---
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [4]:
print("\n--- Numerical Summary Statistics ---")
print(titanic.describe())

print("\n--- Categorical Summary Statistics ---")
print(titanic.describe(include='object'))

--- Numerical Summary Statistics ---
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

--- Categorical Summary Statistics ---
         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

## Reflection 1

### What do you notice about the dataset? Are there any data issues?

**The first thing to be aware of with the missing values is that "age" and "deck" have significant missing values. We could use imputation techniques to estimate the missing values, or we may be deam the features necessary in the analysis.

There's also outlier issues regarding "fare". The mean fare is much higher than the median fare. This does not concern me too much due to the nature of the Titanic being which had low income and higher income passengers.

The other issue is that some features contain low-value information or they are in a format that is not usable for machine learning models. Name is a string. Sex (male/female) can be converted to numerical format. We will likely drop "ticket" because it has many unique value
**